diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Контеева: для контроля отпусков</comment>
  <registerRecords>InformationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Год = ОбщегоНазначенияКлиентСервер.СтрокаВДату(Параметры.Год);   
	ПрочитатьДанныеИзВременногоХранилищаНаСервере(Параметры.АдресВХ)
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеИзВременногоХранилищаНаСервере(Адрес)
	ТаблицаЗначенийОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	Для каждого Стр Из ТаблицаЗначенийОтпускаСотрудников Цикл  
		
		Точка = Диаграмма.УстановитьТочку(Стр.Сотрудник);
		Серия = Диаграмма.УстановитьСерию("Отпуск");    // 
		
		        Серия.Цвет = WEBЦвета.Бирюзовый;
			Серия.Текст = "Отпуск";
			
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти
